Revit 2026 API

# RebarGetFullGeometryForView Method

---

Generates full geometry for the Rebar for a specific view.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public GeometryElement GetFullGeometryForView(
	View view
)
```
```vb
Public Function GetFullGeometryForView (
	view As View
) As GeometryElement
```
```cpp
public:
GeometryElement^ GetFullGeometryForView(
	View^ view
)
```
```fsharp
member GetFullGeometryForView :
        view : View -> GeometryElement
```

#### Parameters

view View
     The view in which the geometry is generated.

#### Return Value

GeometryElement The generated geometry of the Rebar before cutting is applied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The result of this method differs from Element.Geometry in that Element.Geometry will return the rebar geometry cut by the view extents (such as the section box). In this method the entire Rebar geometry is returned for the given view, before cutting.

#### Reference

Rebar Class

Autodesk.Revit.DB.Structure Namespace